{
    "navbar" : {
        "sobreMi" : "About",
        "skills" : "Skills",
        "proyectos" : "Proyectos",
        "charlemos" : "Charlemos"
    },
    "presentacion" : {
        "soy" : "Soy",
        "rol" : "Desarrollador fullstack"
    },
    "aboutMe" : {
        "sobre" : "David",
        "mi" : "Fullstack developer",
        "texto1" : "Soy Técnico en Desarrollo de software, planeo seguir con la licenciatura, y llevo realizando proyectos desde hace mas de 3 años. Estoy enfocado al Backend con JAVA y Spring, además tengo conocimientos en Python, Django, Flask, Node JS y React JS. También conozco de bases de datos SQL y NoSQL.",
        "texto2" : "Mi pasión es crear y desarrollar nuevos productos, optimizar y solucionar problemas. Quiero generar impacto en el mundo a través de la tecnologia!",
        "texto3" : "Si crees que podemos hacer cosas juntos, ¡me encantaría conocerte!",
        "verCv" : "¿Quieres ver mi Cv?"
    },
    "skills" : {
        "textoComplejo1" : "Además, mi formacion como tecnico estuvo fuertemente orientada a la <span class='palabraEspecialSoftSkills' >practica en equipo y a la constante entrega de mejoras</span>. A travez del uso de metodologias agiles, se nos entreno para iterar continuamente sobre el producto buscando nuevas actualizaciones incrementales y mejorando nuestra adaptacion a los cambios.",
        "textoComplejo2" : "Esta forma de estudio, ayudo fortaleciendo mis <span class='palabraEspecialSoftSkills'>capacidades de compañerismo, empatia, comunicacion asertiva, y liderazgo</span>"
    },
    "proyectos" : {
        "titulo" : "Ultimos Proyectos",
        "pr-altour-titulo" : "Altour",
        "pr-altour-descripcion" : "Para mitigar el problema del turismo en ciudades hiper saturadas, proponemos Altour, una web app mobile first, diseñada para redistribuir el flujo turístico de manera más equitativa. Usando un mapa de calor en tiempo real para identificar las areas mas sobrecargadas,basándose en datos de tráfico y movilidad. Esto permite ofrecer destinos alternativos y disfrutar de un turismo único, tranquilo y sostenible. Este proyecto fue construido en 6 semanas, dentro de un equipo agil compuesto por desarrolladores, Ux/Ui y Product Manager. Mi rol estuvo orientando al backend con java - Spring y cumpli una parte fundamental en la integracion con el frontend. Este MVP sirvio para validar rapidamente la propuesta de negocio.",
        "pr-donatello-titulo" : "Donatello",
        "pr-donatello-descripcion" : "Plataforma SaaS que responde a las necesidades de los pequeños comercios de comida, que buscan opciones para administrar sus negocios de forma accesible, intuitiva y a bajo costo. El objetivo del proyecto es contribuir a generar impacto social positivo, combinado con viabilidad técnica y comercial. Buscando una rapida validacion de la idea de negocio, el MVP se desarrollo solo en 4 semanas, dentro de un equipo agil, autogestionado y diverso, con distintos profesionales especializados en UX-UI, Frontend, Backend, DevOps y QA, logrando crear un producto de alta calidad y con gran potencial. Me desempeñe como lider Backend Java, desarrollando y documentando la APIRest, pero mi papel fundamental fue en la integracion entre equipos, ya que comunicaba, negociaba y aceptaba cambios y sugerencias a realizarze entre los distintos repositorios, logrando un exitoso MVP creado por un gran equipo. Utilizamos tecnologias como: Java, Spring, PostgreSQL, Swagger, Spring security, JWT, Angular, Feign, entre otros.",
        "pr-embarcadero-titulo" : "Embarcadero app",
        "pr-embarcadero-descripcion" : "Sistema para gestionar las embarcaciones, las guardias y los equipos de rescate, permite mantener un registro de las embarcaciones que acceden, el personal afectado y otros datos vitales, para estadistica y analisis. Ofrecera un sistema completo para la gestion y control de los dique de la provincia. El proyecto esta en una etapa se desarrollo el primer MVP, y ahora esta en fase de feedback. En esta etapa, ya se realizo el relevamiento, analisis y diseño de la solucion propuesta, junto a su codificacion Web y testeo, usando tecnologias como: Java, Spring, MySQL, Swagger, Spring security, JWT, Mockito, Email sender, etc. El frontend se realizo con React JS, Material UI,  entre otras. Para las futuras iteraciones se incluira App mobile para Android. Se uso tecnologias como: React Js, Java, Spring, MySQL, Swagger, Spring security, JWT. Deploy front en vercel, backend en railway y base de datos en clevercloud.",
        "pr-jam-titulo" : "API RESTFul EduProject en JAVA - Springboot",
        "pr-jam-descripcion" : "Aplicación web, para la gestión de inscripciones, asistencias y usuarios académicos, como parte del evento JAM 2023 para crear soluciones de software gratuitas para emprendedores. A partir de una problemática propuesta, se analizó posibles soluciones que llevaron a diseñar e implementar un MVP, usando Java, Spring, MySQL, PostgreSQL, React Js, Swagger, Figma, Github, Notion, etc. Mi tareas fueron analizar, diseñar, desarrollar y documentar backend con Java - Spring y codificar frontend con React JS. Proyecto desarrollado dentro de un equipo scrum formado por otros devs, UX/UIs y PO, en un proceso iterativo e incremental,  que cumplió el objetivo de entregar un MVP al cliente, superando las expectativas y permitiendo validar la idea de negocio. Aplicacion desplegada en Railway, y base de datos en render",
        "pr-onedrop-mobile-titulo" : "One Drop Mobile",
        "pr-onedrop-mobile-descripcion" : "One drop, es una aplicacion mobile para Android, desarrollada en JAVA, forma parte del ecosistema OneDrop, dando una implementacion especifica para dispositivos moviles. Su funcion es gestionar variables medicas, para una rapida y facil puesta en comun de la informacion con el equipo medico. Creada con fines educativos como parte de una Tecnicatura, nacio en equipo, siguiendo metodologia scrum, donde me encargue de la parte logica de Java en android y liderando el diseño y codificacion del backend en Java - Spring. Creada usando API 31 de android, Java, Spring, Jwt, MySQL, etcs",
        "pr-onedrop-web-titulo" : "One Drop Web",
        "pr-onedrop-web-descripcion" : "One drop, es una aplicacion para gestionar variables medicas, para una rapida y facil puesta en comun de la informacion con el equipo medico. Creada con fines educativos como parte de una Tecnicatura. Desarrollada en angular y conectada a backend desarrollado en Spring. Creada en un equipo agil, donde mi rol principal fue desarrollador backend, liderando el diseño y codificacion del backend en Java - Spring.",
        "pr-mec-titulo" : "Mecantronic",
        "pr-mec-descripcion" : "Trabajo por proyecto para realizar una landing page con React JS, como parte de una propuesta de experiencia laboral real a través de Coderhouse. Se realizó en equipo, formado por UX/UI, SM y PO, de manera remota y usando metodoligas agiles. Mi rol consitio en codificar diseño en React JS, dotar de funcionalidades y testear producto final. Tecnologías principales: React JS, Css, Bootstrap, Material UI, Tailwind, Swiper Js, Toastify, Email Js, Figma, Slack, Notion, Github entre otros. Usamos metodología scrum para gestionar el proyecto, con dailys para seguimiento e iteracion periodica, que nos permitieron cumplir los plazos y requerimientos del cliente, de forma satisfactoria."
    },
    "charlemos" : {
        "titulo" : "¿ Charlamos ?",
        "nombre" : "Nombre",
        "texto" : "¿Que te gustaria contarme?",
        "btnEnviar" : "Enviar"
    }
    
}