{
    "navbar" : {
        "sobreMi" : "About",
        "skills" : "Skills",
        "proyectos" : "Proyects",
        "charlemos" : "Lets chat"
    },
    "presentacion" : {
        "soy" : "I'm",
        "rol" : "Fullstack developer"
    },
    "aboutMe" : {
        "sobre" : "About",
        "mi" : "Me",
        "texto1" : "I have a degree in Software Development Technician, planning to continue with a bachelor's degree, and have been working on projects for the past 3 years. I am focused on Backend development with JAVA and Spring, in addition i have knowledge in Python, Django, Flask, Node JS, and React JS. I also have experience with SQL and NoSQL databases.",
        "texto2" : "My passion is to create and develop new products, optimize and solve problems. I want to change the world through code, and I would love to impact millions of lives!",
        "texto3" : "If you think we can do things together, I would love to meet you!",
        "verCv" : "Would you like to see my resume?"
    },
    "skills" : {
        "textoComplejo1" : "Additionally, my training as a technician was strongly oriented towards <span class='palabraEspecialSoftSkills' >practical teamwork and continuous improvement delivery</span>. Through the use of agile methodologies, we were trained to continuously iterate over the product seeking new incremental updates and improving our adaptation to changes.",
        "textoComplejo2" : "This method of study helped strengthen my <span class='palabraEspecialSoftSkills'>abilities in teamwork, empathy, assertive communication, and leadership.</span>"
    },
    "proyectos" : {
        "titulo" : "Recent projects",
        "pr-donatello-titulo" : "Donatello",
        "pr-donatello-descripcion" : "SaaS platform responding to the needs of small food businesses seeking options to manage their operations in an accessible, intuitive, and low-cost manner. The project's objective is to contribute to generating positive social impact combined with technical and commercial viability. Seeking rapid validation of the business idea, the MVP was developed in just 4 weeks within an agile, self-managed, and diverse team consisting of professionals specialized in UX/UI, Frontend, Backend, DevOps, and QA, achieving the creation of a high-quality product with great potential. I served as the Java Backend leader, developing and documenting the RESTful API, but my fundamental role was in inter-team integration, as I communicated, negotiated, and accepted changes and suggestions to be implemented across different repositories, resulting in a successful MVP created by a great team. We utilized technologies such as Java, Spring, PostgreSQL, Swagger, Spring Security, JWT, Angular, Feign, among others.",
        "pr-embarcadero-titulo" : "Embarcadero app",
        "pr-embarcadero-descripcion" : "System for managing boats, shifts, and rescue teams, allowing maintenance of records for accessing boats, affected personnel, and other vital data for statistics and analysis. It will offer a comprehensive system for management and control of the province's docks. The project is currently at the stage where the first MVP has been developed, and it's now in the feedback phase. In this stage, the survey, analysis, and design of the proposed solution have already been completed, along with web coding and testing, using technologies such as Java, Spring, MySQL, Swagger, Spring Security, JWT, Mockito, Email Sender, etc. The frontend was developed with React JS, Material UI, among others. For future iterations, a mobile app for Android will be included. Technologies used include React JS, Java, Spring, MySQL, Swagger, Spring Security, JWT. Frontend deployed on Vercel, backend on Railway, and database on CleverCloud.",
        "pr-jam-titulo" : "API RESTFul EduProject JAVA - Springboot",
        "pr-jam-descripcion" : "Web application for managing registrations, attendance, and academic users, as part of the JAM 2023 event to create free software solutions for entrepreneurs. Based on a proposed problem, possible solutions were analyzed leading to the design and implementation of an MVP, using Java, Spring, MySQL, PostgreSQL, React Js, Swagger, Figma, Github, Notion, etc. My tasks involved analyzing, designing, developing, and documenting the backend with Java - Spring and coding the frontend with React JS. The project was developed within a Scrum team consisting of other devs, UX/UIs, and PO, following an iterative and incremental process that met the objective of delivering an MVP to the client, exceeding expectations and allowing validation of the business idea. Application deployed on Railway, and database on Render.",
        "pr-onedrop-mobile-titulo" : "One Drop Mobile",
        "pr-onedrop-mobile-descripcion" : "One Drop is a mobile application for Android, developed in Java, forming part of the OneDrop ecosystem, providing a specific implementation for mobile devices. Its function is to manage medical variables, enabling quick and easy sharing of information with the medical team. Created for educational purposes as part of a Technical Degree program, it emerged from a team effort, following Scrum methodology, where I was responsible for the logical part of Java in Android and led the design and coding of the backend in Java - Spring. Created using Android API 31, Java, Spring, JWT, MySQL, etc.",
        "pr-onedrop-web-titulo" : "One Drop Web",
        "pr-onedrop-web-descripcion" : "One Drop is an application for managing medical variables, designed for quick and easy sharing of information with the medical team. Created for educational purposes as part of a Technical Degree program. Developed using Angular and connected to a backend developed in Spring. Created in an agile team, where my primary role was backend developer, leading the design and coding of the backend in Java - Spring.",
        "pr-mec-titulo" : "Mecantronic",
        "pr-mec-descripcion" : "Project-based work to create a landing page with React JS, as part of a proposal for real-world work experience through Coderhouse. It was carried out in a team consisting of UX/UI, SM, and PO, remotely and using agile methodologies. My role consisted of coding the design in React JS, adding functionalities, and testing the final product. Main technologies: React JS, CSS, Bootstrap, Material UI, Tailwind, Swiper Js, Toastify, Email Js, Figma, Slack, Notion, GitHub, among others. We used Scrum methodology to manage the project, with daily stand-ups for tracking and periodic iteration, which allowed us to meet deadlines and client requirements satisfactorily."
        
    },
    "charlemos" : {
        "titulo" : "Would you like to chat?",
        "nombre" : "Name",
        "texto" : "What would you like to tell me?",
        "btnEnviar" : "Send"
    }
    
}